Revit 2026 API

# ReferenceCreateLinkReference Method

---

Creates a Reference from a Reference in an RVT Link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Reference CreateLinkReference(
	RevitLinkInstance revitLinkInstance
)
```
```vb
Public Function CreateLinkReference (
	revitLinkInstance As RevitLinkInstance
) As Reference
```
```cpp
public:
Reference^ CreateLinkReference(
	RevitLinkInstance^ revitLinkInstance
)
```
```fsharp
member CreateLinkReference :
        revitLinkInstance : RevitLinkInstance -> Reference
```

#### Parameters

revitLinkInstance RevitLinkInstance
    Id of the RevitLinkInstance that contains the reference.

#### Return Value

Reference

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when revitLinkInstance is . |

The reference that is returned can be used to create a family instance on a face in an RVT link.

#### Reference

Reference Class

Autodesk.Revit.DB Namespace